src/Reports/ВыпускПродукцииИУслуг/ВыпускПродукцииИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыпускПродукцииИУслуг</name>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтрицательноеКрасным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияНастроекПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПараметрыПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементаОтчета</name>
    <type>
      <types>EnumRef.ПредставленияЭлементовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровки</name>
  </attributes>
</mdclass:Report>

src/Enums/РазделыУчета/РазделыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчета</name>
  <enumValues>
    <name>МПЗ</name>
  </enumValues>
  <enumValues>
    <name>Затраты</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаВыпуск</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыПоНаработке</name>
  </enumValues>
  <enumValues>
    <name>ТоварыОтгруженные</name>
  </enumValues>
  <enumValues>
    <name>МатериалыВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>Выпуск</name>
  </enumValues>
  <enumValues>
    <name>Наработка</name>
  </enumValues>
  <enumValues>
    <name>ПогашеннаяСтоимость</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ВыпускПродукцииИУслуг/Forms/ФормаОтчетаУправляемая/Module.bsl
&НаСервере
Процедура ДоработатьКомпоновщикПередВыводом()

	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	СписокРазделовУчета = Новый СписокЗначений;
	СписокРазделовУчета.Добавить(Перечисления.РазделыУчета.МПЗ);
	СписокРазделовУчета.Добавить(Перечисления.РазделыУчета.ТоварыОтгруженные);
	СписокРазделовУчета.Добавить(Перечисления.РазделыУчета.МатериалыВЭксплуатации);
		
	ПараметрРазделыУчета = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РазделыУчета"));
	Если ПараметрРазделыУчета <> Неопределено Тогда
		ПараметрРазделыУчета.Значение = СписокРазделовУчета;
		ПараметрРазделыУчета.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры // ДоработатьКомпоновщикПередВыводом()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоработатьКомпоновщикПередВыводом();
КонецПроцедуры
